// Задача 6. Является ли число четным
Console.Write("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
if (a % 2 == 0)
{
   Console.WriteLine("число четное"); 
}
else
{
    Console.WriteLine("число нечетное");
}
